tap "arimxyer/tap"
tap "brightdigit/speculid"
tap "buo/cask-upgrade"
tap "cameroncooke/axe"
tap "finestructure/tap"
tap "gromgit/brewtils"
tap "supabase/tap"
tap "swiftdocorg/formulae"
tap "twostraws/brew"
tap "updatest/tap", "https://github.com/updatest/tap.git"
tap "vapor/tap"
tap "vitorgalvao/tiny-scripts"
tap "yonaskolb/mint", "https://github.com/yonaskolb/Mint.git"
tap "yt-dlp/taps"
brew "readline"
brew "aria2"
brew "asitop"
brew "augeas"
brew "automake"
brew "boost"
brew "freetype"
brew "fontconfig"
brew "glib"
brew "harfbuzz"
brew "pango"
brew "librsvg"
brew "chafa"
brew "coreutils"
brew "dialog"
brew "espeak-ng"
brew "eza"
brew "fdupes"
brew "lame"
brew "ffmpeg"
brew "flac"
brew "fswatch"
brew "gh"
brew "gitleaks"
brew "unbound", restart_service: :changed
brew "libksba"
brew "go"
brew "pkgconf"
brew "python@3.13"
brew "gobject-introspection"
brew "graphviz"
brew "hblock"
brew "highlight"
brew "libheif"
brew "imagemagick"
brew "jpegoptim"
brew "jq"
brew "lazygit"
brew "libdvdcss"
brew "libmatroska"
brew "libvorbis"
brew "libsndfile"
brew "libsodium"
brew "libxml2"
brew "libyaml"
brew "llmfit"
brew "llvm"
brew "mas"
brew "meson"
brew "mint"
brew "mkvtoolnix"
brew "mp4v2"
brew "mpv"
brew "ncurses"
brew "neovim"
brew "node"
brew "ollama", restart_service: :changed
brew "openai-whisper"
brew "pandoc"
brew "pipenv"
brew "pipx"
brew "pngcrush"
brew "poppler"
brew "python@3.11"
brew "ranger"
brew "ruby-build"
brew "rbenv"
brew "rsync"
brew "socat"
brew "stow"
brew "swiftformat"
brew "swiftlint"
brew "terminal-notifier"
brew "topgrade"
brew "uv"
brew "websocat"
brew "wget"
brew "xcodegen"
brew "xvid"
brew "yarn"
brew "zlib"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "arimxyer/tap/models"
brew "cameroncooke/axe/axe"
brew "gromgit/brewtils/taproom"
brew "supabase/tap/supabase"
brew "twostraws/brew/appletime"
brew "twostraws/brew/sitrep"
cask "1password"
cask "1password-cli"
cask "adobe-digital-editions"
cask "affinity"
cask "airserver"
cask "airtable"
cask "alt-tab"
cask "anydesk"
cask "apparency"
cask "arturia-software-center"
cask "audio-hijack"
cask "balenaetcher"
cask "boop"
cask "buildsettingextractor"
cask "bunch"
cask "carbon-copy-cloner"
cask "cardhop"
cask "chatgpt"
cask "cirrus"
cask "claude"
cask "cleanupbuddy"
cask "codekit"
cask "cursor"
cask "customshortcuts"
cask "daisydisk"
cask "deckset"
cask "dexed"
cask "discord"
cask "dockdoor"
cask "drawio"
cask "epic-games"
cask "etrecheckpro"
cask "fantastical"
cask "farrago"
cask "fastscripts"
cask "figma"
cask "font-african-sans"
cask "font-average-sans"
cask "font-balsamiq-sans"
cask "font-bubblegum-sans"
cask "font-courier-prime-sans"
cask "font-encode-sans"
cask "font-fira-code"
cask "font-meslo-lg-nerd-font"
cask "font-quattrocento-sans"
cask "forecast"
cask "ghostty"
cask "google-chrome"
cask "hazel"
cask "iina"
cask "ilok-license-manager"
cask "imageoptim"
cask "ios-app-signer"
cask "itch"
cask "izotope-product-portal"
cask "jettison"
cask "keyboard-maestro"
cask "libreoffice"
cask "linear-linear"
cask "little-snitch"
cask "local"
cask "loopback"
cask "macfuse"
cask "melodics"
cask "musescore"
cask "music-remote"
cask "native-access"
cask "ngrok"
cask "obsidian"
cask "omnidisksweeper"
cask "omnifocus"
cask "omnigraffle"
cask "omnioutliner"
cask "onyx"
cask "papers"
cask "pingplotter"
cask "post-haste"
cask "preference-manager"
cask "prefs-editor"
cask "raspberry-pi-imager"
cask "raycast"
cask "rode-central"
cask "rotato"
cask "setapp"
cask "sidequest"
cask "simpholders"
cask "skim"
cask "softube-central"
cask "soundsource"
cask "spitfire-audio"
cask "steam"
cask "symboliclinker"
cask "tailscale-app"
cask "textbuddy"
cask "textexpander"
cask "thetimemachinemechanic"
cask "tower"
cask "transmit"
cask "udeler"
cask "visual-studio-code"
cask "vlc"
cask "warp"
cask "wispr-flow"
cask "wwdc"
cask "xquartz"
cask "zoom"
cask "zxpinstaller"
mas "Accelerate", id: 1459809092
mas "AdaptivityA", id: 1054670022
mas "AlignmentForXcode", id: 1168397789
mas "Amphetamine", id: 937984704
mas "Attributed String Creator Pro", id: 730928349
mas "Aurora", id: 1493055655
mas "Bazinga!", id: 1503241323
mas "Blackmagic Disk Speed Test", id: 425264550
mas "Byword", id: 420212497
mas "Capo", id: 696977615
mas "Cascadea", id: 1432182561
mas "Codye", id: 1516894961
mas "Comment Wrapper", id: 1377998565
mas "Coppice", id: 6741889046
mas "Dark Reader for Safari", id: 1438243180
mas "Day One", id: 1055511498
mas "DevCleaner", id: 1388020431
mas "Developer", id: 640199958
mas "Devly", id: 6759269801
mas "DiskView", id: 6627346631
mas "Drafts", id: 1435957248
mas "Duplicate Photos Fixer Pro", id: 963642514
mas "Final Cut Pro", id: 424389933
mas "Formatter", id: 1190228172
mas "Googly Eyes", id: 6743048714
mas "Grammarly for Safari", id: 1462114288
mas "Grocery", id: 1195676848
mas "Hacktivate", id: 6748286602
mas "Harvest", id: 506189836
mas "iPulse", id: 1028916583
mas "JSON Helper", id: 453114608
mas "Kaleidoscope", id: 587512244
mas "Keynote", id: 409183694
mas "Keyword Search", id: 1558453954
mas "Laminar", id: 0
mas "Levelator", id: 1493326487
mas "Location Helper", id: 488536386
mas "Logic Pro", id: 634148309
mas "Mactracker", id: 430255202
mas "Marked 3", id: 0
mas "Mastonaut", id: 1450757574
mas "Moom Classic", id: 419330170
mas "Motion", id: 434290957
mas "Name Mangler 3", id: 603637384
mas "Napkin", id: 581789185
mas "Numbers", id: 409203825
mas "Obsidian Web Clipper", id: 6720708363
mas "OneTab", id: 1540160809
mas "Pages", id: 409201541
mas "Paprika Recipe Manager 3", id: 1303222628
mas "Parcel", id: 375589283
mas "Paste JSON as Code • quicktype", id: 1330801220
mas "Pasteboard Viewer", id: 1499215709
mas "Pastel", id: 413897608
mas "Patterns", id: 429449079
mas "PayPal Honey", id: 1472777122
mas "Peek", id: 1554235898
mas "Petrify", id: 1451177988
mas "Photomator", id: 1444636541
mas "PhotoStickies", id: 447313635
mas "Pins", id: 1547106997
mas "Pixave", id: 924891282
mas "Pixelmator Pro", id: 1289583905
mas "Play", id: 1596506190
mas "PolyCapture", id: 6504193234
mas "ReadCube Papers Extension", id: 1543891759
mas "RegExLab", id: 1252988123
mas "Screens 5", id: 1663047912
mas "Shareful", id: 1522267256
mas "SnippetsLab", id: 1006087419
mas "Speedtest", id: 1153157709
mas "Tapestry", id: 6448078074
mas "Tapestry Loom", id: 6578414736
mas "TestFlight", id: 899247664
mas "Transporter", id: 1450874784
mas "URL Linker", id: 1289119450
mas "Velja", id: 1607635845
mas "WhatFont", id: 1437138382
mas "WhatsApp", id: 310633997
mas "XCFormat", id: 1165321484
mas "xScope", id: 889428659
vscode "aaron-bond.better-comments"
vscode "alexdima.copy-relative-path"
vscode "anthropic.claude-code"
vscode "christian-kohler.path-intellisense"
vscode "davidanson.vscode-markdownlint"
vscode "deerawan.vscode-dash"
vscode "donjayamanne.githistory"
vscode "esbenp.prettier-vscode"
vscode "evgeniypeshkov.syntax-highlighter"
vscode "github.vscode-github-actions"
vscode "google.geminicodeassist"
vscode "llvm-vs-code-extensions.lldb-dap"
vscode "ms-azuretools.vscode-containers"
vscode "ms-python.autopep8"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "naumovs.color-highlight"
vscode "openai.chatgpt"
vscode "pnp.polacode"
vscode "ritwickdey.liveserver"
vscode "steoates.autoimport"
vscode "swiftlang.swift-vscode"
vscode "vscode-icons-team.vscode-icons"
go "github.com/danielmiessler/fabric/cmd/fabric"
cargo "linear-cli"
uv "audiblez", with: ["pip"]
uv "docling-mcp"
uv "notebooklm-mcp-cli"
uv "pre-commit"
